{
    "title": "Portafolio | MateoDev",
    "description": "Soy Mateo, posiblemente el mejor programador de la historia y mejor Ingeniero de Sistemas.",
    "image": "/avatar.jpg",
    "avatar": "/avatar.jpg",
    "name": "Mateo Alejandro Mora Hernández",
    "skill": "Ingeniero de Sistemas, Técnico en Sistemas, Desarrollador Backend y Arquitecto de Software",
    "location": "Girardot, Cundinamarca, Colombia",
    "media": {
        "email": "mateoalejandromorahernandez@gmail.com",
        "cv": "/data/cv.pdf",
        "github": "https://github.com/Matius2002",
        "likedin": "https://www.linkedin.com/in/mateo-alejandro-mora-hern%C3%A1ndez-49a2b520a"
    },
    "about": "!Hola¡ Soy un desarrollador backend colombiano de 23 años, ingeniero de sistemas egresado de la Universidad Piloto de Colombia y técnico en sistemas del SENA. Me especializo en el desarrollo de soluciones escalables con Java y Spring Boot, y también manejo otros lenguajes de programación. Actualmente brindo soporte TI de nivel 2, lo que me ha permitido fortalecer mis habilidades técnicas y mi capacidad de resolución de problemas en entornos reales.\n\nTengo nivel de inglés B2, buen manejo de herramientas ofimáticas y estoy en proceso de formación como arquitecto de software. Me apasiona escribir código limpio, aprender nuevas tecnologías y participar en proyectos desafiantes. El deporte es parte importante de mi vida, ya que me ayuda a mantener el enfoque y la disciplina en mi crecimiento profesional.",
    "technologies": [
        {
            "icon": "devicon-java-plain colored",
            "name": "Java"
        },
        {
            "icon": "devicon-spring-plain colored",
            "name": "Spring Boot"
        },
        {
            "icon": "devicon-postgresql-plain colored",
            "name": "PostgreSQL"
        },
        {
            "icon": "devicon-mysql-plain colored",
            "name": "MySQL"
        },
        {
            "icon": "devicon-graphql-plain colored",
            "name": "GraphQL"
        },
        {
            "icon": "devicon-docker-plain colored",
            "name": "Docker"
        },
        {
            "icon": "devicon-python-plain colored",
            "name": "Python"
        },
        {
            "icon": "devicon-git-plain colored",
            "name": "Git"
        }
    ],
    "experience": [
        {
            "icon": "terminal",
            "title": "Practicante Universitario",
            "subtitle": "Desarrollo de Software y Soporte TI N2",
            "description": "Participé en el desarrollo de un sistema de novedades tecnológicas utilizando el siguiente stack tecnológico: Angular para el frontend, Spring Boot para la lógica del backend, Tailwind CSS para un diseño responsivo y estético, y PostgreSQL como sistema gestor de bases de datos. El sistema permitió el registro, seguimiento y gestión de novedades para el área de sistemas.",
            "date": "2024"
        },
        {
            "icon": "rabbit",
            "title": "Freelance",
            "subtitle": "Desarrollador FullSctak y Soporte Técnico",
            "description": "Diseñé y desarrollé aplicaciones de escritorio personalizadas utilizando Spring Boot (Java). También creé páginas web estáticas con un enfoque en la funcionalidad, limpieza visual y accesibilidad, empleando tecnologías como HTML5, CSS3 y JavaScript. Además, brindé asesoramiento integral al cliente durante todo el proceso de desarrollo: análisis de requerimientos, prototipado, entrega y soporte técnico posterior.",
            "date": "2023 - Actualidad"
        }
    ],
    "projects": [
        {
            "icon": "gamepad",
            "title": "TuristExplor",
            "subtitle": "Promoción de zonas turisticas en Girardot, Cundinamarca",
            "description": "TuristExplor es un proyecto desarrollado como trabajo de grado bajo la metodología ágil XP, con el objetivo de promover las zonas turísticas de Girardot, Cundinamarca (Colombia). La solución incluye un mapa interactivo, sistema de comentarios y calificaciones, panel administrativo, sección de noticias y categorización de destinos. Fue construido con Angular (frontend), Spring Boot (backend), PostgreSQL y desplegado en AWS. Proyecto realizado entre 2023 y 2024 junto a mi colega Mateo Rico Hernández.",
            "technologies": [
                {
                    "icon": "devicon-angular-plain",
                    "name": "Angular"
                },
                {
                    "icon": "devicon-spring-plain",
                    "name": "Spring Boot"
                },
                {
                    "icon": "devicon-tailwindcss-plain",
                    "name": "Tailwind CSS"
                },
                {
                    "icon": "devicon-postgresql-plain",
                    "name": "PostgreSQL"
                }

            ],
            "image": "/project_3.jpg",
            "url": "https://github.com/Matius2002/FrontTuristExplor",
            "github": "https://github.com/Matius2002/BackTuristExplor"
        },
        {
            "icon": "bug-off",
            "title": "Junical Medical S.A.S",
            "subtitle": "Gestión de incidencias tecnologícas",
            "description": "Sistema Web para Gestión de Incidencias – Clínica Juncial Medical S.A.S. Diseñé e implementé un sistema web para centralizar el registro de incidencias tecnológicas, reemplazando el uso informal de WhatsApp y mejorando la trazabilidad, privacidad y comunicación. Tecnologías: Angular, Spring Boot, PostgreSQL, Tailwind CSS.",
            "technologies": [
                {
                    "icon": "devicon-angular-plain",
                    "name": "Angular"
                },
                {
                    "icon": "devicon-spring-plain",
                    "name": "Spring Boot"
                },
                {
                    "icon": "devicon-tailwindcss-plain",
                    "name": "Tailwind CSS"
                },
                {
                    "icon": "devicon-postgresql-plain",
                    "name": "PostgreSQL"
                }
            ],
            "image": "/project_4.png",
            "url": "https://github.com/Matius2002/frontPro",
            "github": "https://github.com/Matius2002/backend-pro-main"
        }
    ],
    "training": [
        {
            "icon": "backpack",
            "title": "Universidad Piloto de Colombia",
            "subtitle": "Universidad",
            "description": "Durante mi formación profesional, adquirí competencias sólidas en desarrollo de software, bases de datos, arquitectura de sistemas y gestión de proyectos. Desarrollé habilidades técnicas en tecnologías como Angular, Spring Boot, Java, TypeScript, HTML/CSS, PostgreSQL y herramientas de control de versiones como Git. Mi proyecto de grado, TuritExplor, consistió en una plataforma web diseñada para promover las zonas turísticas del municipio de Girardot. La plataforma integra mapas interactivos, imágenes, descripciones, opiniones y calificaciones de usuarios, además de contar con un panel administrativo que permite la gestión de contenido por parte de usuarios con rol de administrador.",
            "date": "2019 - 2025",
            "certificate": "https://drive.google.com/file/d/1RVlWi7sj6WKNlFqt5K2gnwQ8lVpHP_1z/view?usp=sharing"
        },
        {
            "icon": "graduation-cap",
            "title": "Servicio Nacional de Aprendizaje(SENA)",
            "subtitle": "Centro de formacion publico",
            "description": "Durante mi formación como Técnico en Sistemas en el SENA, adquirí conocimientos sólidos en la instalación, configuración y mantenimiento de equipos de cómputo, redes básicas y soporte técnico. Participé en prácticas enfocadas en la resolución de problemas informáticos, fortaleciendo mis habilidades en diagnóstico de fallas, manejo de software y atención al usuario. Esta experiencia me permitió desarrollar una base técnica sólida y un enfoque proactivo para enfrentar retos tecnológicos.",
            "date": "2017 - 2018",
            "certificate": "https://drive.google.com/file/d/1CGvXsNU2HzSbrDVwvTODlZJGGk64Slyq/view?usp=sharing"
        },
        {
            "icon": "graduation-cap",
            "title": "Institución Educativa Policarpa Salavarrieta",
            "subtitle": "Colegio",
            "description": "Culminé mis estudios de secundaria en la Institución Educativa Policarpa Salavarrieta, ubicada en Girardot, Cundinamarca, donde cursé desde sexto hasta undécimo grado. Durante este período, desarrollé competencias académicas, valores éticos y habilidades sociales que fortalecieron mi disciplina, responsabilidad y capacidad para el trabajo en equipo. Esta etapa formativa fue fundamental para mi crecimiento personal y para la preparación de mis estudios técnicos y profesionales.",
            "date": "2013 - 2018",
            "certificate": "https://drive.google.com/file/d/1MzI5P9hUIL4K6I0o6ujnWEsNuNm3i5l4/view?usp=sharing"
        },
        {
            "icon": "graduation-cap",
            "title": "Institución Educativa Ramon Bueno y Jose Triana",
            "subtitle": "Escuela",
            "description": "Estas primeras experiencias educativas fomentaron mi capacidad para resolver problemas, comunicarme efectivamente y adaptarme a nuevos retos, habilidades que posteriormente fortalecí y apliqué en el campo de la programación web. La disciplina y la organización que desarrollé desde pequeño han sido pilares para mi crecimiento profesional y para el aprendizaje constante en el mundo tecnológico.",
            "date": "2008 - 2012",
            "certificate": ""
        }
    ],
    "extras": [
        {
            "image": "/project_1.jpg",
            "title": "Snake Game",
            "description": "Este juego fue creado con el propósito de reforzar conocimientos y desarrollar habilidades lógicas.",
            "url": "https://matius2002.github.io/"
        }
    ]
}